# Conditional Element Operations

In [2]:
import numpy as np
import pandas as pd
m= np.random.randint(1,30, size=(10,3))
df=pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    16    12     3
1    24    21     6
2    21     9    16
3    16    18    22
4    13    14     4
5    10    20     1
6    15    13    24
7     4    17    26
8     2     9    10
9    15    18    15

In [3]:
df["var1"]

0    16
1    24
2    21
3    16
4    13
5    10
6    15
7     4
8     2
9    15
Name: var1, dtype: int32

In [4]:
df["var1"][0:2]

0    16
1    24
Name: var1, dtype: int32

In [7]:
df[["var1","var2"]][0:4]

   var1  var2
0    16    12
1    24    21
2    21     9
3    16    18

In [8]:
df

   var1  var2  var3
0    16    12     3
1    24    21     6
2    21     9    16
3    16    18    22
4    13    14     4
5    10    20     1
6    15    13    24
7     4    17    26
8     2     9    10
9    15    18    15

In [9]:
df.var1

0    16
1    24
2    21
3    16
4    13
5    10
6    15
7     4
8     2
9    15
Name: var1, dtype: int32

In [10]:
df[df.var1>15]

   var1  var2  var3
0    16    12     3
1    24    21     6
2    21     9    16
3    16    18    22

In [12]:
df[df.var1>15]["var1"]

0    16
1    24
2    21
3    16
Name: var1, dtype: int32

In [13]:
df[(df.var1>15)&(df.var3<5)]

   var1  var2  var3
0    16    12     3

In [14]:
df[df.var1>15,["var1","var2"]]

TypeError: '(0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: var1, dtype: bool, ['var1', 'var2'])' is an invalid key

In [16]:
df[df.var1>15][["var1","var2"]]

   var1  var2
0    16    12
1    24    21
2    21     9
3    16    18

In [17]:
df.loc[(df.var1>15),["var1","var2"]]

   var1  var2
0    16    12
1    24    21
2    21     9
3    16    18